<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Area;

class AreaSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $areas = [
            'سیاه اسطلخ',
            'گلباغ نماز',
            'تختی',
            'دیانتی',
            'رودباری',
            'لاکانی',
            'گلسار',
            'دیلمان',
            'بلوار خرمشهر',
            'انصاری',
            'پستک',
            'هلال اهمر',
            'سایپا',
            'یخسازی',
            'جانبازان',
            'نیروی دریایی',
            'شالکوه',
            'علی‌آباد',
            'آب و برق',
            'چمران',
            'گیل',
            'جماران',
            'پارک شهر',
            'نامجو',
            'گاز',
            'توشیبا',
            'معلم',
            'زرجوب',
            'مطهری',
            'امام خمینی',
            'حاجی‌آباد',
            'پارک شهر',
            'گلسار',
            'بوسار',
            'پیربازار',
            'فخب',
            'احمد گوراب',
            'جاده لاکان',
            'پل طالشان',
            'استقامت',
            'حمیدیان',
            'پسیخان',
            'چله خانه',
            'استادسرا',
            'صیقلان',
            'سعدی',
            'سبزه میدان',
            'پل عراق',
            'سام',
            'خواهر امام',
            'رشتیان ',
            'سلیمان داراب',
            'تازه آباد',
            'منظریه',
        ];

        $areas = array_unique($areas);
        foreach ($areas as $area)
            Area::create([
                'name' => $area,
                'state_id' => 1,
                'city_id'  => 3361
            ]);
    }
}
